Bot_token = '7316899744:AAH5yMK_F6NieQrSq7J6JAulMkiHEWXK654'
admin_id = 6673121916
Giveaccessyoutube = '7826710907:AAG0uMSHntK63VhhO-x7j-0SPatmNisUNow'

#Bot_token = '7343032550:AAElcysYekfpuDKC-3MopyCfM-VnnGvKZOs'
#Giveaccessyoutube = '7120583959:AAFBhfuOox4HIrOhu1c5f_mkWoC3GfKY3XE'

Text = ['''
Що таке API-ключ YouTube?
API-ключ YouTube дозволяє вашому застосунку взаємодіяти з API YouTube для отримання даних про канали, відео, плейлисти тощо. Цей ключ служить як унікальний ідентифікатор вашої програми.

Кроки для отримання API-ключа YouTube

1. Створіть акаунт Google
Якщо у вас ще немає Google-акаунта, зареєструйте його.
API-ключ прив'язується до вашого Google-акаунта.

2. Перейдіть до Google Cloud Console
Відкрийте Google Cloud Console.
Увійдіть до свого Google-акаунта.

3. Створіть новий проект
У верхньому меню натисніть на "Select a project" або "Створити проект".
У вікні, що з'явиться:
Введіть назву вашого проекту (наприклад, "YouTube Data Project").
Виберіть організацію або залиште поле порожнім, якщо це ваш особистий обліковий запис.
Натисніть Create.

4. Активуйте API YouTube
У лівому меню натисніть "API & Services" → "Library".
У рядку пошуку введіть "YouTube Data API v3".
Клацніть на знайдений API і натисніть Enable.

5. Створіть API-ключ
Перейдіть до "API & Services" → "Credentials".
Натисніть "Create Credentials" → виберіть API Key.

Ваш API-ключ буде згенеровано і відображено у вікні. Натисніть Copy, щоб скопіювати ключ.

Ось детальна інформація:
https://opencartbot.com/ru/blog/youtube-api-key
Або перегляньте наше відео:
''',
'''
Скупка YouTube-каналів – @Fr1ge_seller

Приєднуйтесь до нашого Telegram-каналу https://t.me/+hr3Z2gURwTkzYzM6, щоб дізнатися всі деталі та отримати швидку відповідь на ваші запитання.

💬 Вся інформація про умови співпраці, ціни та процедуру продажу – вже чекає на вас у нашому ТГ-каналі!

Fr1ge купляє знайдені канали, тому якщо ви знайшли цікаві канали для продажу вам до нього!
''',
'''
🚀 В нашому боті також доступна функція купівлі реклами!

Хочете просунути свій продукт чи послугу? Залучайте нових клієнтів через рекламу в нашому боті!

💬 Всі питання з купівлі реклами – звертайтесь до @vladuslavmen. Ми допоможемо вам налаштувати ефективну рекламну кампанію та залучити вашу аудиторію!

Не втрачайте можливість підвищити видимість свого бізнесу!
''',
'''
Користуватися нашим ботом дуже просто! Ось що потрібно зробити:

Новий канал: Якщо ти тільки зареєструвався, натискаєш кнопку "Новий канал". Ти отримаєш 20 безкоштовних каналів для початку. Кнопка "Новий канал" відповідає за подачу каналів, які будуть надані тобі для аналізу.

Коли ліміт вичерпано: Після того, як ти використаєш всі 20 каналів, є два варіанти:

Купити преміум доступ: Для цього напиши @vladuslavmen для отримання більш детальної інформації.

Регенерація своїх каналів: Якщо хочеш свої канали, натискаєш "Нова підбірка каналів", вводиш свій API ключ і слово, за яким будуть шукатися канали. Канали додаються в приватну базу каналів, і ти можеш проходитися по своїм каналам.

Що таке API ключ? Інформацію можна знайти в загальних налаштуваннях бота, де є докладний опис, як його отримати.

Канали купує Фрідж! Для того щоб дізнатися більше інформації про нього, зайди на наш канал, де все детально пояснено.

Також, у нашому боті є функція купівлі реклами. Якщо хочеш розмістити рекламу або дізнатися більше, звертайся до @vladuslavmen!''']