API_KEY = 'fqdNcEbWByI9RRrLN7xeGqU8z9R2YewjKAhpbsuK4qKdqWNl7UcSsDBrpT8kUMNR'
API_SECRET = 'ridlyfUEsnZiKbcWsZTrMwcm6DwICcCNKoLIWpx6Zf2bioIiSEGPwnwONZqNXVuj'
Bot_token1 = '7343032550:AAElcysYekfpuDKC-3MopyCfM-VnnGvKZOs'
COINGECKO_API_TOKEN = "9799b7faf69e8a01bc4a9968cea89520a088a820"
GPT_API = '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'
News_API_TOKEN = 'dffd1728e2354006851bc4749f3bdbcb'

Bot_token = '7316899744:AAH5yMK_F6NieQrSq7J6JAulMkiHEWXK654'
admin_id = 6673121916
Giveaccessyoutube = '7826710907:AAG0uMSHntK63VhhO-x7j-0SPatmNisUNow'


Text = ['''
Що таке API-ключ YouTube?
API-ключ YouTube – це унікальний ідентифікатор, який дозволяє вашому додатку працювати з API YouTube. За допомогою цього ключа ви можете отримувати дані про канали, відео, плейлисти тощо.

Як отримати API-ключ:
Зареєструйте Google-акаунт, якщо у вас його ще немає.
Перейдіть у Google Cloud Console (console.cloud.google.com).
Створіть проект:
Натисніть "Створити проект".
Дайте проекту назву, наприклад, "YouTube Data Project".
Активуйте API YouTube:
У меню оберіть "Library" і знайдіть "YouTube Data API v3".
Увімкніть його (Enable).
Згенеруйте API-ключ:
Зайдіть у розділ "Credentials" і натисніть "Create Credentials".
Оберіть "API Key".
Готово! Скопіюйте ваш ключ і використовуйте його для роботи з ботом.

Більше інформації можна знайти тут:

https://opencartbot.com/ru/blog/youtube-api-key

Або перегляньте наше відео:
''',
'''
Хто такий Фрідж і що таке скупка каналів?
@Fr1ge_seller – це спеціаліст із купівлі YouTube-каналів.

Якщо ви знаходите цікаві YouTube-канали для продажу, звертайтесь до Фріджа! Він допоможе оцінити вартість та придбати канал у найкоротший термін.

Як дізнатися більше?
Приєднуйтесь до нашого Telegram-каналу:
👉 https://t.me/+hr3Z2gURwTkzYzM6

💬 У нашому каналі ви знайдете інформацію про умови співпраці, ціни та процес продажу.
''',
'''
Реклама в боті
🚀 Реклама через наш бот – це чудова можливість залучити нових клієнтів чи просунути свій продукт!

Як це працює?
Ви надаєте інформацію про свій продукт.
Ми допомагаємо налаштувати рекламну кампанію.
Ваш продукт отримує увагу аудиторії через ефективну рекламу.
💬 За деталями звертайтеся до:
@vladuslavmen

Не втрачайте шанс зробити ваш бізнес помітним!
''',
'''
Привіт! 👋
Я — бот, який допоможе тобі знаходити YouTube-канали для роботи, реклами чи співпраці. Ось що я вмію:

🔍 Знайти канали: Підбираю YouTube-канали на основі твоїх даних (API-ключа і пошукового слова).
📺 Отримати канал: Видаю випадковий YouTube-канал для ознайомлення.
🎁 Реферальна програма: Запрошуй друзів і отримуй 10 безкоштовних каналів за кожного нового користувача!
ℹ️ Про бота: Розкажу все, що тобі потрібно знати про мої функції, API-ключ, Фріджа і рекламу.
Якщо потрібна допомога, просто натискай на кнопки і слідуй підказкам. 🚀 @vladuslavmen!''',
'''
🤖Як працює бот?

Наш бот працює швидко та ефективно! Він шукає понад 600 каналів за хвилину, ретельно перебираючи їх за специфічними критеріями фріджа. У нас є велика база даних з понад 6000 каналів, і ось які можливості вам доступні:

1. 📺 Отримати канал
Натискаючи на кнопку "Отримати канал", ви отримуєте вже знайдений канал із нашої бази даних. Це дозволяє швидко знайти та отримати канали, які відповідають вашим вимогам. База постійно оновлюється, і ви завжди можете бути впевненими у якості знайдених каналів.

2. 🔍 Знайти канали
Кнопка "Знайти канали" дозволяє вам почати пошук каналів за заданими критеріями. Ви можете використовувати своє власне пошукове слово та API-ключ, щоб знайти канали, які вас цікавлять. Бот автоматично обробить запит і надасть вам відповідні канали з бази.

3. 🎁 Реферальна програма
Наш бот має чудову реферальну програму! Ви можете створити власний реферальний код та поділитися ним з іншими користувачами. Коли хтось введе ваш код, ви отримаєте +10 безкоштовних каналів для пошуку та отримання. Це чудова можливість збільшити свій доступ до більшої кількості каналів!

4. ℹ️ Про бота
Дізнайтесь більше про бота та його можливості:

Хто такий Фрідж? – отримаєте інформацію про цю функцію бота та як вона працює.
Що таке API-ключ? – ми пояснимо, що це за ключ і як його створити для роботи з ботом.
Цей бот створений, щоб зробити пошук каналів максимально швидким і зручним. Користуйтесь усіма його функціями та отримуйте доступ до найкращих каналів на платформі!''']
